#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// Возвращает строку для вставки в HTML с описанием типа объекта
// Параметры:
// Компонента - ПеречислениеСсылка.граф_КомпонентыГрафа
// Возвращаемое значение:
// Строка - описание объекта
Функция ОписаниеКомпонентаГрафа(Компонента) Экспорт
	
	Если Компонента = Ребро Тогда
		Результат = ПолучитьМакет("ШаблонРеброПоУмолчанию").ПолучитьТекст();
	ИначеЕсли Компонента = Вершина Тогда
		Результат = ПолучитьМакет("ШаблонВершинаПоУмолчанию").ПолучитьТекст();
	ИначеЕсли Компонента = Контейнер Тогда
		Результат = ПолучитьМакет("ШаблонКонтейнерПоУмолчанию").ПолучитьТекст();
	Иначе
		ВызватьИсключение "Некорректный тип компонента";
	КонецЕсли;
	Возврат Результат;
КонецФункции
#КонецОбласти
#КонецЕсли
