#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	Компонент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипОформления, "Компонент");
	УбратьОбрамляющиеСкобки();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура УбратьОбрамляющиеСкобки()
	ОписаниеJSON = граф_РаботаСТекстомКлиентСервер.СодержимоеВнутриСкобок(ОписаниеJSON);
КонецПроцедуры
#КонецОбласти

#КонецЕсли



