
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ШаблонТекстаСтраницы = ПолучитьОбщийМакет("граф_ШаблонHTML").ПолучитьТекст();
	БиблиотекаG6 = ПолучитьОбщийМакет("граф_БиблиотекаG6Версия4").ПолучитьТекст();
	СкриптИнициализации = ПолучитьОбщийМакет("граф_СкриптИнициализацииГрафа").ПолучитьТекст();
	НовыйЭлемент = ПолучитьОбщийМакет("граф_НовоеРебро").ПолучитьТекст(); 
	ШаблонТекстаСтраницы = СтрЗаменить(ШаблонТекстаСтраницы, "//содержимое библиотеки", БиблиотекаG6);
	ШаблонТекстаСтраницы = СтрЗаменить(ШаблонТекстаСтраницы, "//инициализация графа", СкриптИнициализации);
	ШаблонТекстаСтраницы = СтрЗаменить(ШаблонТекстаСтраницы, "//данные графа", НовыйЭлемент);
	СодержимоеСтраницы = ШаблонТекстаСтраницы;
КонецПроцедуры
#КонецОбласти
